README.org
#+startup: showeverything
#+title: QC
#+property: header-args:bash :results verbatim

* QC

** create project folder and links to FATSQ raw data files:

Create a project folder

#+begin_src bash :results output
# create folders for compressed raw data, and decompressed raw data 
mkdir -p ~/nanopore_analysis/{1_raw_data,2_fastq_decompressed}
# create folders for QC
mkdir -p ~/nanopore_analysis/{3_fastqc,4_fastp,5_minionqc}
mkdir -p ~/nanopore_analysis/{6_nanofilt,7_nanoplot}
# create folders for Assembly
mkdir -p ~/nanopore_analysis/{9_metaflye,10_raven,11_canu}
# create folders for verification tools Assembly 
mkdir -p ~/nanopore_analysis/{12_metaquast,13_bandage}
# show definitive folder structure
tree ~/nanopore_analysis
#+end_src

Create links to FASTQ raw data

IMPORTANT: [[https://github.com/nanoporetech/dorado][Dorado]] tool is needed to convert pod5 to fastq, but it's unavailable on the server, so the fastq files provided were used instead.
After created the project folder, we needed to create links to conect the origin "fastq_pass" folder, containing the barcode folders, to the destiny folder ~/nanopore_analysis/1_raw_data:

#+begin_src bash :results silent :export both
# create links to raw data (all the barcode directories with fastq.gz files stored in fastq_pass)
ln -s /group/lectures/DTAN25data/BIOINF26_Gruppe2/no_sample_id/20250219_2052_MN35031_FBA50370_f12dc3bb/fastq_pass/* ~/nanopore_analysis/1_raw_data
# remove non-relevant folders (barcodes 01-08 and barcodes 17-24 and also the unclassified...)
ls | grep -vE 'barcode0[9-9]|barcode1[0-6]' | xargs rm
# now we can have access to the barcode folders 
ls -l
# and also access the fastq.gz files inside, like in this summary:
for folder in barcode09 barcode1{0..6}; do
  count=$(ls "$folder"/*.gz 2>/dev/null | wc -l) # Count the .gz files in the folder
  echo "Folder: $folder ($count gz files)"
done
# create links to raw data (all the barcode directories with fastq.gz files stored in fastq_pass)
ln -s /group/lectures/DTAN25data/BIOINF26_Gruppe2/no_sample_id/20250219_2052_MN35031_FBA50370_f12dc3bb/fastq_pass/* ~/nanopore_analysis/1_raw_data
# remove non-relevant folders (barcodes 01-08 and barcodes 17-24 and also the unclassified...)
ls | grep -vE 'barcode0[9-9]|barcode1[0-6]' | xargs rm
# now we can have access to the barcode folders 
ls -l
# and also access the fastq.gz files inside, like in this summary:
for folder in barcode09 barcode1{0..6}; do
  count=$(ls "$folder"/*.gz 2>/dev/null | wc -l) # Count the .gz files in the folder
  echo "Folder: $folder ($count gz files)"
done
#+end_src

Decompressing =fastq.gz= Files

Decompress all the fastq.gz files (do not worry, it is less than 10 min)

#+begin_src bash
# decompress all fastq.gz files (takes < 10 min)
cd ~/nanopore_analysis/1_raw_data
for barcode in barcode*; do
  mkdir -p ../2_fastq_decompressed/$barcode
  gunzip -c $barcode/*.fastq.gz > ../2_fastq_decompressed/$barcode/combined.fastq
done
ls -hs ~/nanopore_analysis/2_fastq_decompressed/*/*
# check that fastqc worked:
# cat ~/nanopore_analysis/2_fastq_decompressed/barcode01/combined.fastq | head -n 10
#+end_src

** fastQC
*** example with only barcode09
#+begin_src bash
# fastqc: - requirements (output directory must exist)
cd ~/nanopore_analysis/2_fastq_decompressed
for barcode in barcode09; do
  # mkdir -p ~/nanopore_analysis/3_fastqc/"$barcode"
  # fastqc "$barcode"/combined.fastq \
    #        --outdir ~/nanopore_analysis/3_fastqc/"$barcode" \
    #        --extract \
    # 	   --threads 4
  tree ~/nanopore_analysis/3_fastqc/"$barcode"
done
#+end_src

#+RESULTS:
#+begin_example
/home/rmedina/nanopore_analysis/3_fastqc/barcode09
├── combined_fastqc
│   ├── fastqc_data.txt
│   ├── fastqc.fo
│   ├── fastqc_report.html
│   ├── Icons
│   │   ├── error.png
│   │   ├── fastqc_icon.png
│   │   ├── tick.png
│   │   └── warning.png
│   ├── Images
│   │   ├── adapter_content.png
│   │   ├── duplication_levels.png
│   │   ├── per_base_n_content.png
│   │   ├── per_base_quality.png
│   │   ├── per_base_sequence_content.png
│   │   ├── per_sequence_gc_content.png
│   │   ├── per_sequence_quality.png
│   │   └── sequence_length_distribution.png
│   └── summary.txt
├── combined_fastqc.html
└── combined_fastqc.zip

3 directories, 18 files
#+end_example

#+begin_src bash
cat ~/nanopore_analysis/3_fastqc/barcode09/combined_fastqc/summary.txt
#+end_src

#+RESULTS:
#+begin_example
PASS	Basic Statistics	combined.fastq
FAIL	Per base sequence quality	combined.fastq
PASS	Per sequence quality scores	combined.fastq
FAIL	Per base sequence content	combined.fastq
PASS	Per sequence GC content	combined.fastq
PASS	Per base N content	combined.fastq
WARN	Sequence Length Distribution	combined.fastq
PASS	Sequence Duplication Levels	combined.fastq
PASS	Overrepresented sequences	combined.fastq
PASS	Adapter Content	combined.fastq
#+end_example



*** fastqc from barcode10 to barcode16
#+begin_src bash
cd ~/nanopore_analysis/2_fastq_decompressed
for barcode in barcode10; do
  mkdir -p ~/nanopore_analysis/3_fastqc/"$barcode"
  fastqc "$barcode"/combined.fastq \
         --outdir ~/nanopore_analysis/3_fastqc/"$barcode" \
         --extract \
	 --threads 4
  tree ~/nanopore_analysis/3_fastqc/"$barcode"
done
#+end_src

#+RESULTS:
#+begin_example
Analysis complete for combined.fastq
/home/rmedina/nanopore_analysis/3_fastqc/barcode10
├── combined_fastqc
│   ├── fastqc_data.txt
│   ├── fastqc.fo
│   ├── fastqc_report.html
│   ├── Icons
│   │   ├── error.png
│   │   ├── fastqc_icon.png
│   │   ├── tick.png
│   │   └── warning.png
│   ├── Images
│   │   ├── adapter_content.png
│   │   ├── duplication_levels.png
│   │   ├── per_base_n_content.png
│   │   ├── per_base_quality.png
│   │   ├── per_base_sequence_content.png
│   │   ├── per_sequence_gc_content.png
│   │   ├── per_sequence_quality.png
│   │   └── sequence_length_distribution.png
│   └── summary.txt
├── combined_fastqc.html
└── combined_fastqc.zip

3 directories, 18 files
#+end_example

#+begin_src bash
printf '\n==> summary.txt:\n'
cat ~/nanopore_analysis/3_fastqc/barcode10/combined_fastqc/summary.txt
printf '\n--> fastqc_data.txt:\n'
head ~/nanopore_analysis/3_fastqc/barcode10/combined_fastqc/fastqc_data.txt
#+end_src

#+RESULTS:
#+begin_example

==> summary.txt:
PASS	Basic Statistics	combined.fastq
FAIL	Per base sequence quality	combined.fastq
PASS	Per sequence quality scores	combined.fastq
FAIL	Per base sequence content	combined.fastq
FAIL	Per sequence GC content	combined.fastq
PASS	Per base N content	combined.fastq
WARN	Sequence Length Distribution	combined.fastq
PASS	Sequence Duplication Levels	combined.fastq
PASS	Overrepresented sequences	combined.fastq
PASS	Adapter Content	combined.fastq

--> fastqc_data.txt:
##FastQC	0.11.9
>>Basic Statistics	pass
#Measure	Value
Filename	combined.fastq
File type	Conventional base calls
Encoding	Sanger / Illumina 1.9
Total Sequences	729889
Sequences flagged as poor quality	0
Sequence length	61-225281
%GC	36
#+end_example

*** fastqc of all barcodes

generate the fastqc files

#+begin_src bash
cd ~/nanopore_analysis/2_fastq_decompressed
for barcode in barcode09 barcode1{0..6}; do
  mkdir -p ~/nanopore_analysis/3_fastqc/"$barcode"
  fastqc "$barcode"/combined.fastq \
         --outdir ~/nanopore_analysis/3_fastqc/"$barcode" \
         --extract \
	 --threads 4
done
#+end_src

*** check total sequencews and the most relevant information from fastqc_data.txt

