README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-27 Do 08:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QC</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">QC</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9e42380">1. QC</a>
<ul>
<li><a href="#org2d1a2bd">1.1. create project folder and links to FATSQ raw data files:</a></li>
<li><a href="#org46e3bbc">1.2. fastQC</a>
<ul>
<li><a href="#org4749ee4">1.2.1. example with only barcode09</a></li>
<li><a href="#org93ed4a8">1.2.2. fastqc from barcode10 to barcode16</a></li>
<li><a href="#orgabaca80">1.2.3. fastqc of all barcodes</a></li>
<li><a href="#org608fa69">1.2.4. check total sequencews and the most relevant information from fastqc<sub>data.txt</sub></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org03d3fce">2. total sequeces fastqc files</a>
<ul>
<li><a href="#org2305a28">2.1. <span class="todo TODO">TODO</span> QC: fastp</a></li>
</ul>
</li>
<li><a href="#orge5d1189">3. <span class="todo TODO">TODO</span> QC: MinIONQC</a></li>
<li><a href="#org9759da0">4. relevant aditional information</a>
<ul>
<li><a href="#org812c04f">4.1. tools available in server</a></li>
</ul>
</li>
<li><a href="#org470f032">5. databases for kraken:</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9e42380" class="outline-2">
<h2 id="org9e42380"><span class="section-number-2">1</span> QC</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2d1a2bd" class="outline-3">
<h3 id="org2d1a2bd"><span class="section-number-3">1.1</span> create project folder and links to FATSQ raw data files:</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Create a project folder<br />
</p>

<div class="org-src-container">
<pre class="src src-bash"># create folders for compressed raw data, and decompressed raw data 
mkdir -p ~/nanopore_analysis/{1_raw_data,2_fastq_decompressed}
# create folders for QC
mkdir -p ~/nanopore_analysis/{3_fastqc,4_fastp,5_minionqc}
mkdir -p ~/nanopore_analysis/{6_nanofilt,7_nanoplot}
# create folders for Assembly
mkdir -p ~/nanopore_analysis/{9_metaflye,10_raven,11_canu}
# create folders for verification tools Assembly 
mkdir -p ~/nanopore_analysis/{12_metaquast,13_bandage}
# show definitive folder structure
tree ~/nanopore_analysis
</pre>
</div>

<p>
Create links to FASTQ raw data<br />
</p>

<p>
IMPORTANT: <a href="https://github.com/nanoporetech/dorado">Dorado</a> tool is needed to convert pod5 to fastq, but it's unavailable on the server, so the fastq files provided were used instead.<br />
After created the project folder, we needed to create links to conect the origin "fastq<sub>pass</sub>" folder, containing the barcode folders, to the destiny folder ~/nanopore<sub>analysis</sub>/1<sub>raw</sub><sub>data</sub>:<br />
</p>

<div class="org-src-container">
<pre class="src src-bash"># create links to raw data (all the barcode directories with fastq.gz files stored in fastq_pass)
ln -s /group/lectures/DTAN25data/BIOINF26_Gruppe2/no_sample_id/20250219_2052_MN35031_FBA50370_f12dc3bb/fastq_pass/* ~/nanopore_analysis/1_raw_data
# remove non-relevant folders (barcodes 01-08 and barcodes 17-24 and also the unclassified...)
ls | grep -vE 'barcode0[9-9]|barcode1[0-6]' | xargs rm
# now we can have access to the barcode folders 
ls -l
# and also access the fastq.gz files inside, like in this summary:
for folder in barcode09 barcode1{0..6}; do
  count=$(ls "$folder"/*.gz 2&gt;/dev/null | wc -l) # Count the .gz files in the folder
  echo "Folder: $folder ($count gz files)"
done
# create links to raw data (all the barcode directories with fastq.gz files stored in fastq_pass)
ln -s /group/lectures/DTAN25data/BIOINF26_Gruppe2/no_sample_id/20250219_2052_MN35031_FBA50370_f12dc3bb/fastq_pass/* ~/nanopore_analysis/1_raw_data
# remove non-relevant folders (barcodes 01-08 and barcodes 17-24 and also the unclassified...)
ls | grep -vE 'barcode0[9-9]|barcode1[0-6]' | xargs rm
# now we can have access to the barcode folders 
ls -l
# and also access the fastq.gz files inside, like in this summary:
for folder in barcode09 barcode1{0..6}; do
  count=$(ls "$folder"/*.gz 2&gt;/dev/null | wc -l) # Count the .gz files in the folder
  echo "Folder: $folder ($count gz files)"
done
</pre>
</div>

<p>
Decompressing <code>fastq.gz</code> Files<br />
</p>

<p>
Decompress all the fastq.gz files (do not worry, it is less than 10 min)<br />
</p>

<div class="org-src-container">
<pre class="src src-bash"># decompress all fastq.gz files (takes &lt; 10 min)
cd ~/nanopore_analysis/1_raw_data
for barcode in barcode*; do
  mkdir -p ../2_fastq_decompressed/$barcode
  gunzip -c $barcode/*.fastq.gz &gt; ../2_fastq_decompressed/$barcode/combined.fastq
done
ls -hs ~/nanopore_analysis/2_fastq_decompressed/*/*
# check that fastqc worked:
# cat ~/nanopore_analysis/2_fastq_decompressed/barcode01/combined.fastq | head -n 10
</pre>
</div>
</div>
</div>

<div id="outline-container-org46e3bbc" class="outline-3">
<h3 id="org46e3bbc"><span class="section-number-3">1.2</span> fastQC</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org4749ee4" class="outline-4">
<h4 id="org4749ee4"><span class="section-number-4">1.2.1</span> example with only barcode09</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-bash"># fastqc: - requirements (output directory must exist)
cd ~/nanopore_analysis/2_fastq_decompressed
for barcode in barcode09; do
  # mkdir -p ~/nanopore_analysis/3_fastqc/"$barcode"
  # fastqc "$barcode"/combined.fastq \
    #        --outdir ~/nanopore_analysis/3_fastqc/"$barcode" \
    #        --extract \
    # 	   --threads 4
  tree ~/nanopore_analysis/3_fastqc/"$barcode"
done
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">cat ~/nanopore_analysis/3_fastqc/barcode09/combined_fastqc/summary.txt
</pre>
</div>
</div>
</div>



<div id="outline-container-org93ed4a8" class="outline-4">
<h4 id="org93ed4a8"><span class="section-number-4">1.2.2</span> fastqc from barcode10 to barcode16</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-bash">cd ~/nanopore_analysis/2_fastq_decompressed
for barcode in barcode10; do
  mkdir -p ~/nanopore_analysis/3_fastqc/"$barcode"
  fastqc "$barcode"/combined.fastq \
         --outdir ~/nanopore_analysis/3_fastqc/"$barcode" \
         --extract \
	 --threads 4
  tree ~/nanopore_analysis/3_fastqc/"$barcode"
done
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">printf '\n==&gt; summary.txt:\n'
cat ~/nanopore_analysis/3_fastqc/barcode10/combined_fastqc/summary.txt
printf '\n--&gt; fastqc_data.txt:\n'
head ~/nanopore_analysis/3_fastqc/barcode10/combined_fastqc/fastqc_data.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-orgabaca80" class="outline-4">
<h4 id="orgabaca80"><span class="section-number-4">1.2.3</span> fastqc of all barcodes</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
generate the fastqc files<br />
</p>

<div class="org-src-container">
<pre class="src src-bash">cd ~/nanopore_analysis/2_fastq_decompressed
for barcode in barcode09 barcode1{0..6}; do
  mkdir -p ~/nanopore_analysis/3_fastqc/"$barcode"
  fastqc "$barcode"/combined.fastq \
         --outdir ~/nanopore_analysis/3_fastqc/"$barcode" \
         --extract \
	 --threads 4
done
</pre>
</div>
</div>
</div>

<div id="outline-container-org608fa69" class="outline-4">
<h4 id="org608fa69"><span class="section-number-4">1.2.4</span> check total sequencews and the most relevant information from fastqc<sub>data.txt</sub></h4>
</div>
</div>
</div>
