README.org
* total sequeces fastqc files

Acees to the fastqc_data.txt file:

/home/rmedina/nanopore_analysis/3_fastqc/barcode09
├── combined_fastqc
│   ├── fastqc_data.txt

print resume table:

#+begin_src bash
cd /home/rmedina/nanopore_analysis/3_fastqc
for barcode in barcode*
do
  printf "${barcode}:   "
  cat /home/rmedina/nanopore_analysis/3_fastqc/"$barcode"/combined_fastqc/fastqc_data.txt \
    | grep '^Total'
done
#+end_src

#+RESULTS:
: barcode09:   Total Sequences	1065437
: barcode10:   Total Sequences	729889
: barcode11:   Total Sequences	1217908
: barcode12:   Total Sequences	667557
: barcode13:   Total Sequences	407956
: barcode14:   Total Sequences	83556
: barcode15:   Total Sequences	735701
: barcode16:   Total Sequences	1156564


print the most relevant data in fastqc_data.txt
- Total Sequences
- Sequences flagged as poor quality
- Sequence length


#+begin_src bash :wrap src org
cd ~/nanopore_analysis/2_fastq_decompressed
print_separator() {
    printf "|-------------------------------------+-----------------------|\n"
}
for barcode in barcode09 barcode1{0..6}; do
  # mkdir -p ~/nanopore_analysis/3_fastqc/"$barcode"
  # fastqc "$barcode"/combined.fastq \
  #        --outdir ~/nanopore_analysis/3_fastqc/"$barcode" \
  #        --extract \
  # 	 --threads 4
	 fastqc_file="../3_fastqc/${barcode}/combined_fastqc/fastqc_data.txt"

  # Function to print the horizontal separator
  # Print table header
  print_separator
  printf "| dir: %-30s |  file: %-14s |\n" "${barcode}" "combined.fastq"
  print_separator
  
  # Check if the file exists and format the output
  if [[ -f "$fastqc_file" ]]; then
    # Define the specific lines to extract
    sed -n '6p;7p;8p;9p;10p' "$fastqc_file" | while IFS=$'\t' read -r measure value; do
    printf "| %-35s | %-21s |\n" "$measure" "$value"
    done
  else
    printf "| %-35s | %-21s |\n" "File Missing" "N/A"
  fi
done
print_separator
#+end_src

RESULTS:

#+begin_src org
|-------------------------------------+-----------------------|
| dir: barcode09                      |  file: combined.fastq |
|-------------------------------------+-----------------------|
| Encoding                            | Sanger / Illumina 1.9 |
| Total Sequences                     | 1065437               |
| Sequences flagged as poor quality   | 0                     |
| Sequence length                     | 29-391635             |
| %GC                                 | 42                    |
|-------------------------------------+-----------------------|
| dir: barcode10                      |  file: combined.fastq |
|-------------------------------------+-----------------------|
| Encoding                            | Sanger / Illumina 1.9 |
| Total Sequences                     | 729889                |
| Sequences flagged as poor quality   | 0                     |
| Sequence length                     | 61-225281             |
| %GC                                 | 36                    |
|-------------------------------------+-----------------------|
| dir: barcode11                      |  file: combined.fastq |
|-------------------------------------+-----------------------|
| Encoding                            | Sanger / Illumina 1.9 |
| Total Sequences                     | 1217908               |
| Sequences flagged as poor quality   | 0                     |
| Sequence length                     | 64-305294             |
| %GC                                 | 44                    |
|-------------------------------------+-----------------------|
| dir: barcode12                      |  file: combined.fastq |
|-------------------------------------+-----------------------|
| Encoding                            | Sanger / Illumina 1.9 |
| Total Sequences                     | 667557                |
| Sequences flagged as poor quality   | 0                     |
| Sequence length                     | 44-259254             |
| %GC                                 | 44                    |
|-------------------------------------+-----------------------|
| dir: barcode13                      |  file: combined.fastq |
|-------------------------------------+-----------------------|
| Encoding                            | Sanger / Illumina 1.9 |
| Total Sequences                     | 407956                |
| Sequences flagged as poor quality   | 0                     |
| Sequence length                     | 42-380798             |
| %GC                                 | 40                    |
|-------------------------------------+-----------------------|
| dir: barcode14                      |  file: combined.fastq |
|-------------------------------------+-----------------------|
| Encoding                            | Sanger / Illumina 1.9 |
| Total Sequences                     | 83556                 |
| Sequences flagged as poor quality   | 0                     |
| Sequence length                     | 59-242572             |
| %GC                                 | 43                    |
|-------------------------------------+-----------------------|
| dir: barcode15                      |  file: combined.fastq |
|-------------------------------------+-----------------------|
| Encoding                            | Sanger / Illumina 1.9 |
| Total Sequences                     | 735701                |
| Sequences flagged as poor quality   | 0                     |
| Sequence length                     | 29-397562             |
| %GC                                 | 69                    |
|-------------------------------------+-----------------------|
| dir: barcode16                      |  file: combined.fastq |
|-------------------------------------+-----------------------|
| Encoding                            | Sanger / Illumina 1.9 |
| Total Sequences                     | 1156564               |
| Sequences flagged as poor quality   | 0                     |
| Sequence length                     | 59-241224             |
| %GC                                 | 45                    |
|-------------------------------------+-----------------------|
#+end_src

