README.html

<div id="outline-container-org03d3fce" class="outline-2">
<h2 id="org03d3fce"><span class="section-number-2">2</span> total sequeces fastqc files</h2>
<div class="outline-text-2" id="text-2">
<p>
Acees to the fastqc<sub>data.txt</sub> file:<br />
</p>

<p>
/home/rmedina/nanopore<sub>analysis</sub>/3<sub>fastqc</sub>/barcode09<br />
├── combined<sub>fastqc</sub><br />
│   ├── fastqc<sub>data.txt</sub><br />
</p>

<p>
print resume table:<br />
</p>

<div class="org-src-container">
<pre class="src src-bash">cd /home/rmedina/nanopore_analysis/3_fastqc
for barcode in barcode*
do
  printf "${barcode}:   "
  cat /home/rmedina/nanopore_analysis/3_fastqc/"$barcode"/combined_fastqc/fastqc_data.txt \
    | grep '^Total'
done
</pre>
</div>

<p>
RESULTS:<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">barcode09:</td>
<td class="org-left">Total Sequences	1065437</td>
</tr>

<tr>
<td class="org-left">barcode10:</td>
<td class="org-left">Total Sequences	729889</td>
</tr>

<tr>
<td class="org-left">barcode11:</td>
<td class="org-left">Total Sequences	1217908</td>
</tr>

<tr>
<td class="org-left">barcode12:</td>
<td class="org-left">Total Sequences	667557</td>
</tr>

<tr>
<td class="org-left">barcode13:</td>
<td class="org-left">Total Sequences	407956</td>
</tr>

<tr>
<td class="org-left">barcode14:</td>
<td class="org-left">Total Sequences	83556</td>
</tr>

<tr>
<td class="org-left">barcode15:</td>
<td class="org-left">Total Sequences	735701</td>
</tr>

<tr>
<td class="org-left">barcode16:</td>
<td class="org-left">Total Sequences	1156564</td>
</tr>
</tbody>
</table>


<p>
a table with a most detailed information in fastqc<sub>data.txt</sub><br />
</p>
<ul class="org-ul">
<li>Total Sequences<br /></li>
<li>Sequences flagged as poor quality<br /></li>
<li>Sequence length<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">cd ~/nanopore_analysis/2_fastq_decompressed
print_separator() {
    printf "|-------------------------------------+-----------------------|\n"
}
for barcode in barcode09 barcode1{0..6}; do
  # mkdir -p ~/nanopore_analysis/3_fastqc/"$barcode"
  # fastqc "$barcode"/combined.fastq \
  #        --outdir ~/nanopore_analysis/3_fastqc/"$barcode" \
  #        --extract \
  # 	 --threads 4
	 fastqc_file="../3_fastqc/${barcode}/combined_fastqc/fastqc_data.txt"

  # Function to print the horizontal separator
  # Print table header
  print_separator
  printf "| dir: %-30s |  file: %-14s |\n" "${barcode}" "combined.fastq"
  print_separator
  
  # Check if the file exists and format the output
  if [[ -f "$fastqc_file" ]]; then
    # Define the specific lines to extract
    sed -n '6p;7p;8p;9p;10p' "$fastqc_file" | while IFS=$'\t' read -r measure value; do
    printf "| %-35s | %-21s |\n" "$measure" "$value"
    done
  else
    printf "| %-35s | %-21s |\n" "File Missing" "N/A"
  fi
done
print_separator
</pre>
</div>

<p>
RESULTS:<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">dir: barcode09</th>
<th scope="col" class="org-right">file: combined.fastq</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Encoding</td>
<td class="org-right">Sanger / Illumina 1.9</td>
</tr>

<tr>
<td class="org-left">Total Sequences</td>
<td class="org-right">1065437</td>
</tr>

<tr>
<td class="org-left">Sequences flagged as poor quality</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Sequence length</td>
<td class="org-right">29-391635</td>
</tr>

<tr>
<td class="org-left">%GC</td>
<td class="org-right">42</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">dir: barcode10</th>
<th scope="col" class="org-right">file: combined.fastq</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Encoding</td>
<td class="org-right">Sanger / Illumina 1.9</td>
</tr>

<tr>
<td class="org-left">Total Sequences</td>
<td class="org-right">729889</td>
</tr>

<tr>
<td class="org-left">Sequences flagged as poor quality</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Sequence length</td>
<td class="org-right">61-225281</td>
</tr>

<tr>
<td class="org-left">%GC</td>
<td class="org-right">36</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">dir: barcode11</th>
<th scope="col" class="org-right">file: combined.fastq</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Encoding</td>
<td class="org-right">Sanger / Illumina 1.9</td>
</tr>

<tr>
<td class="org-left">Total Sequences</td>
<td class="org-right">1217908</td>
</tr>

<tr>
<td class="org-left">Sequences flagged as poor quality</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Sequence length</td>
<td class="org-right">64-305294</td>
</tr>

<tr>
<td class="org-left">%GC</td>
<td class="org-right">44</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">dir: barcode12</th>
<th scope="col" class="org-right">file: combined.fastq</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Encoding</td>
<td class="org-right">Sanger / Illumina 1.9</td>
</tr>

<tr>
<td class="org-left">Total Sequences</td>
<td class="org-right">667557</td>
</tr>

<tr>
<td class="org-left">Sequences flagged as poor quality</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Sequence length</td>
<td class="org-right">44-259254</td>
</tr>

<tr>
<td class="org-left">%GC</td>
<td class="org-right">44</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">dir: barcode13</th>
<th scope="col" class="org-right">file: combined.fastq</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Encoding</td>
<td class="org-right">Sanger / Illumina 1.9</td>
</tr>

<tr>
<td class="org-left">Total Sequences</td>
<td class="org-right">407956</td>
</tr>

<tr>
<td class="org-left">Sequences flagged as poor quality</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Sequence length</td>
<td class="org-right">42-380798</td>
</tr>

<tr>
<td class="org-left">%GC</td>
<td class="org-right">40</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">dir: barcode14</th>
<th scope="col" class="org-right">file: combined.fastq</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Encoding</td>
<td class="org-right">Sanger / Illumina 1.9</td>
</tr>

<tr>
<td class="org-left">Total Sequences</td>
<td class="org-right">83556</td>
</tr>

<tr>
<td class="org-left">Sequences flagged as poor quality</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Sequence length</td>
<td class="org-right">59-242572</td>
</tr>

<tr>
<td class="org-left">%GC</td>
<td class="org-right">43</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">dir: barcode15</th>
<th scope="col" class="org-right">file: combined.fastq</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Encoding</td>
<td class="org-right">Sanger / Illumina 1.9</td>
</tr>

<tr>
<td class="org-left">Total Sequences</td>
<td class="org-right">735701</td>
</tr>

<tr>
<td class="org-left">Sequences flagged as poor quality</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Sequence length</td>
<td class="org-right">29-397562</td>
</tr>

<tr>
<td class="org-left">%GC</td>
<td class="org-right">69</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">dir: barcode16</th>
<th scope="col" class="org-right">file: combined.fastq</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Encoding</td>
<td class="org-right">Sanger / Illumina 1.9</td>
</tr>

<tr>
<td class="org-left">Total Sequences</td>
<td class="org-right">1156564</td>
</tr>

<tr>
<td class="org-left">Sequences flagged as poor quality</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Sequence length</td>
<td class="org-right">59-241224</td>
</tr>

<tr>
<td class="org-left">%GC</td>
<td class="org-right">45</td>
</tr>
</tbody>
</table>
</div>
