README.org
** TODO QC: fastp
 
#+begin_src sh :results output
# cd ~/nanopore_analysis/0_scripts
mkdir -p ~/nanopore_analysis/4_fastp
cd $_
wget http://opengene.org/fastp/fastp
chmod a+x ./fastp
ls -hs fastp
#+end_src

#+RESULTS:
: 9,1M fastp

# #+begin_src sh :results output
# ~/nanopore_analysis/4_fastp
# for barcode in "/home/rmedina/nanopore_analysis/2_fastq_decompressed/barcode09":
# do
#   # ls $barcodecode
# done
# #fastp -i ../2_fastq_decompressed/barcode01
# # fastp -i ../2_fastq_decompressed 
# # cd ~/nanopore_analysis/4_fastp 
# #+end_src

* TODO QC: MinIONQC


* relevant aditional information


** tools available in server
#+begin_src bash
ls /group/bin/kaiju*
ls /group/bin/kraken*
#+end_src

#+RESULTS:
: /group/bin/kaiju
: /group/bin/kaiju2krona
: /group/bin/kaiju2table
: /group/bin/kaiju-addTaxonNames
: /group/bin/kaiju-mergeOutputs
: /group/bin/kallisto
: /group/bin/kraken2
: /group/bin/kraken2-build
: /group/bin/kraken2-inspect


* databases for kraken:

#+begin_src bash
tree -d /group/db
#+end_src

#+RESULTS:
#+begin_example
/group/db
├── blastdb
│   ├── refseq_prot
│   └── refseq_rna
├── bowtie2db_v31_2019
├── bowtie2db_vJan21
├── bowtie2GRCh38
├── centrifuge
├── diamonduniprot
├── humann
│   ├── chocophlan
│   ├── chocophlan_v201901
│   └── uniref
├── k2leather
│   ├── library
│   │   ├── added
│   │   └── human
│   └── taxonomy
├── kaijudb
│   ├── nr
│   └── nr_euk
├── kraken
├── Kraken2_092024
├── minimap2leather
└── taxonomy

24 directories
#+end_example

