README.html

<div id="outline-container-org2305a28" class="outline-3">
<h3 id="org2305a28"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> QC: fastp</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sh"># cd ~/nanopore_analysis/0_scripts
mkdir -p ~/nanopore_analysis/4_fastp
cd $_
wget http://opengene.org/fastp/fastp
chmod a+x ./fastp
ls -hs fastp
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge5d1189" class="outline-2">
<h2 id="orge5d1189"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> QC: MinIONQC</h2>
</div>


<div id="outline-container-org9759da0" class="outline-2">
<h2 id="org9759da0"><span class="section-number-2">4</span> relevant aditional information</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org812c04f" class="outline-3">
<h3 id="org812c04f"><span class="section-number-3">4.1</span> tools available in server</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-bash">ls /group/bin/kaiju*
ls /group/bin/kraken*
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org470f032" class="outline-2">
<h2 id="org470f032"><span class="section-number-2">5</span> databases for kraken:</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-bash">tree -d /group/db
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-03-27 Do 08:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
